import { MissionDetail } from "@/types";

export const information: MissionDetail = {
  index: 3,
  internal: 3,
  summary: "虽然发生了预料之外的事，但在密阿雷的生活已经开始了。向盖伊／塔霓请教关于这座城市的各种事情吧。",
  process: [
    "在１楼大厅集合。",
    "与在旅馆Ｚ的庭院等待的盖伊／塔霓打宝可梦对战。",
    "前往密阿雷南站前的宝可梦中心。",
    "在宝可梦中心听取说明。",
    "为了捉住宝可梦，前往“野生特区”。",
    "投掷精灵球，捉住小箭雀。",
    "通过招式减少ＨＰ后，投掷精灵球，捉住掘掘兔。",
    "在图鉴中添加５种以上的宝可梦，前往宝可梦研究所。",
    "在宝可梦研究所汇报图鉴活动的情况。",
    "从主菜单中确认茉蜜姬调查。",
    "回到旅馆Ｚ，与盖伊／塔霓会合。",
  ],
  location: "",
  unlockCondition: "",
};
