import { MissionDetail } from "@/types";

export const information: MissionDetail = {
  index: 14,
  internal: 14,
  summary: "（主角）的下一个对手是在实况直播领域大受欢迎的卡娜莉。找出她的所在地，在升级战中获胜吧！",
  process: [
    "与琵鲁对战，获得卡娜莉的信息。",
    "获得挑战券，与琵鲁搭话。",
    "在卡娜莉狂热问答王争夺战的会场前与琵鲁会合。",
    "报名参加卡娜莉狂热问答王争夺战。",
    "卡娜莉擅长的是“落下型益智游戏”。……〇还是×？",
    "卡娜莉喜欢的是“马卡龙”。……〇还是×？",
    "卡娜莉喜欢的是“电属性”。……〇还是×？",
    "进入卡娜莉狂热问答王争夺战的第二轮。",
    "在英俊咖啡馆购买特别的密阿雷格雷派饼。",
    "回到会场，回答问题。",
    "在宝可梦对战中获胜，获得回答问题的权利。",
    "前往卡娜莉指定的木根工程。",
    "调查木根工程车库里的小房间。",
    "与卡娜莉打升级战。",
  ],
  location: "",
  unlockCondition: "",
};
