import { MissionDetail } from "@/types";

export const information: MissionDetail = {
  index: 20,
  internal: 20,
  summary: "发现盖伊／塔霓向锈蚀组借了钱。超Ｚ队必须尽快解决这个问题。",
  process: [
    "前往锈蚀组的事务所。",
    "与锈蚀组的吉普索对战。",
    "在锈蚀组的事务所谈重要的事。",
    "回到旅馆Ｚ，和大家商量锈蚀组的事。",
    "开始超Ｚ队的作战会议。",
    "解决全部３件失控超级进化的委托。",
    "回到旅馆Ｚ。",
    "在有隐情的商住楼解决与调皮的家伙们的“纠纷”。",
    "赶走商住楼的所有宝可梦，然后告诉委托人。",
    "给蔓延在阴暗世界中的垃圾来场“大扫除”。",
    "破坏地下所有的超级结晶，向锈蚀组的姐姐汇报。",
    "解决与“其他组织成员”的纠纷。",
    "与密阿雷社交对战俱乐部的训练家对战。",
    "与乌羽一起确认银行前的骚动。",
    "回到旅馆Ｚ。",
    "在锈蚀组的事务所与乌羽见面。",
  ],
  location: "",
  unlockCondition: "",
};
