import { MissionDetail } from "@/types";

export const information: MissionDetail = {
  index: 35,
  internal: 35,
  summary: "（主角）的下一个对手是名为“古历”的不明人士。照片也不清晰，需要查明对方的身份。",
  process: [
    "与玛琪艾儿谈论身份不明的对战对手，“古历”相关的事。",
    "为了获得“古历”的信息，与玛琪艾儿对战。",
    "向宝可梦研究所的茉蜜姬询问有关“古历”的事。",
    "在新咖啡点“升级战”。",
    "前往古历指定的地方。",
    "与古丽兹对战。",
    "进入破旧的咖啡店遗址。",
    "从隐藏通道进入弗拉达利研究所。",
    "探索弗拉达利研究所，获得电梯钥匙。",
    "使用电梯，前往弗拉达利研究所的地下３楼。",
    "前往弗拉达利研究所地下３楼的实验室。",
    "与在弗拉达利咖啡店等待的古历对话。",
    "与ＡＺ谈话，决定接下来该怎么办。",
    "获得挑战券，与古历打升级战。",
  ],
  location: "",
  unlockCondition: "",
};
