import { MissionDetail } from "@/types";

export const information: MissionDetail = {
  index: 12,
  internal: 12,
  summary: "异次元的谜团已经解开，但安馨儿原本的目标——传说的宝可梦仍未找到。看来还需要继续调查。",
  process: [
    "去和乌羽谈谈关于安馨儿在异次元看到的宝可梦一事。",
    "准备好甜甜圈，调查异次元密阿雷。",
    "在新咖啡与乌羽会合。",
    "带着丰缘的粗盐，回到安馨儿的身边。",
    "捉住２只传说的宝可梦。它们分别是藏身在朱红色扭洞的固拉多，与藏身在靛蓝色扭洞的盖欧卡。",
    "回到旅馆Z，与安馨儿谈话。",
    "准备好甜甜圈，调查异次元密阿雷。",
    "回到旅馆Z。",
    "制作挑战翠绿色扭洞所需的德尔塔蛋糕甜甜圈，与可尔妮他们会合。",
    "捕捉传说的宝可梦烈空坐。",
  ],
  location: "",
  unlockCondition: "",
};
