import { Pokemon, PokemonForm, PokemonType } from "../types";
import { getPokemonFullId, getPokemonFullName } from "../utils";

const HiddenPokemonForm: PokemonForm[] = [
  "658-1", // 小智版甲贺忍蛙,
];

const tsv = `
编号	全国图鉴编号	图鉴编号	形态编号	中文名	日文名	英文名	形态名	属性1	属性2	HP	攻击	防御	特攻	特防	速度	X	Y
1	001	148	0	妙蛙种子	フシギダネ	Bulbasaur		草	毒	45	49	49	65	65	45	1	0
2	002	149	0	妙蛙草	フシギソウ	Ivysaur		草	毒	60	62	63	80	80	60	2	0
3	003	150	0	妙蛙花	フシギバナ	Venusaur		草	毒	80	82	83	100	100	80	4	0
3	003	150	1	妙蛙花	フシギバナ	Venusaur	超级妙蛙花	草	毒	80	100	123	122	120	80	5	0
4	004	151	0	小火龙	ヒトカゲ	Charmander		火	火	39	52	43	60	50	65	6	0
5	005	152	0	火恐龙	リザード	Charmeleon		火	火	58	64	58	80	65	80	7	0
6	006	153	0	喷火龙	リザードン	Charizard		火	飞行	78	84	78	109	85	100	8	0
6	006	153	1	喷火龙	リザードン	Charizard	超级喷火龙Ｘ	火	龙	78	130	111	130	85	100	9	0
6	006	153	2	喷火龙	リザードン	Charizard	超级喷火龙Ｙ	火	飞行	78	104	78	159	115	100	10	0
7	007	154	0	杰尼龟	ゼニガメ	Squirtle		水	水	44	48	65	50	64	43	11	0
8	008	155	0	卡咪龟	カメール	Wartortle		水	水	59	63	80	65	80	58	12	0
9	009	156	0	水箭龟	カメックス	Blastoise		水	水	79	83	100	85	105	78	13	0
9	009	156	1	水箭龟	カメックス	Blastoise	超级水箭龟	水	水	79	103	120	135	115	78	14	0
13	013	018	0	独角虫	ビードル	Weedle		虫	毒	40	35	30	20	20	50	15	0
14	014	019	0	铁壳蛹	コクーン	Kakuna		虫	毒	45	25	50	25	25	35	16	0
15	015	020	0	大针蜂	スピアー	Beedrill		虫	毒	65	90	40	45	80	75	17	0
15	015	020	1	大针蜂	スピアー	Beedrill	超级大针蜂	虫	毒	65	150	40	15	80	145	18	0
16	016	021	0	波波	ポッポ	Pidgey		一般	飞行	40	45	40	35	35	56	19	0
17	017	022	0	比比鸟	ピジョン	Pidgeotto		一般	飞行	63	60	55	50	50	71	0	1
18	018	023	0	大比鸟	ピジョット	Pidgeot		一般	飞行	83	80	75	70	70	101	1	1
18	018	023	1	大比鸟	ピジョット	Pidgeot	超级大比鸟	一般	飞行	83	80	80	135	80	121	2	1
23	023	060	0	阿柏蛇	アーボ	Ekans		毒	毒	35	60	44	40	54	55	3	1
24	024	061	0	阿柏怪	アーボック	Arbok		毒	毒	60	95	69	65	79	80	4	1
25	025	053	0	皮卡丘	ピカチュウ	Pikachu		电	电	35	55	40	50	50	90	6	1
26	026	054	0	雷丘	ライチュウ	Raichu		电	电	60	90	55	90	80	110	9	1
26	026	054	1	雷丘	ライチュウ	Raichu	阿罗拉的样子	电	超能力	60	85	50	95	85	110	8	1
35	035	056	0	皮皮	ピッピ	Clefairy		妖精	妖精	70	45	48	60	65	35	10	1
36	036	057	0	皮可西	ピクシー	Clefable		妖精	妖精	95	70	73	95	90	60	11	1
36	036	057	1	皮可西	ピクシー	Clefable	超级皮可西	妖精	飞行	95	80	93	135	110	70	12	1
63	063	062	0	凯西	ケーシィ	Abra		超能力	超能力	25	20	15	105	55	90	13	1
64	064	063	0	勇基拉	ユンゲラー	Kadabra		超能力	超能力	40	35	30	120	70	105	15	1
65	065	064	0	胡地	フーディン	Alakazam		超能力	超能力	55	50	45	135	95	120	17	1
65	065	064	1	胡地	フーディン	Alakazam	超级胡地	超能力	超能力	55	50	65	175	105	150	18	1
66	066	125	0	腕力	ワンリキー	Machop		格斗	格斗	70	80	50	35	35	35	19	1
67	067	126	0	豪力	ゴーリキー	Machoke		格斗	格斗	80	100	70	50	60	45	0	2
68	068	127	0	怪力	カイリキー	Machamp		格斗	格斗	90	130	80	65	85	55	1	2
69	069	074	0	喇叭芽	マダツボミ	Bellsprout		草	毒	50	75	35	70	30	40	2	2
70	070	075	0	口呆花	ウツドン	Weepinbell		草	毒	65	90	50	85	45	55	3	2
71	071	076	0	大食花	ウツボット	Victreebel		草	毒	80	105	65	100	70	70	4	2
71	071	076	1	大食花	ウツボット	Victreebel	超级大食花	草	毒	80	125	85	135	95	70	5	2
79	079	137	0	呆呆兽	ヤドン	Slowpoke		水	超能力	90	65	65	40	40	15	6	2
79	079	137	1	呆呆兽	ヤドン	Slowpoke	伽勒尔的样子	超能力	超能力	90	65	65	40	40	15	7	2
80	080	138	0	呆壳兽	ヤドラン	Slowbro		水	超能力	95	75	110	100	80	30	8	2
80	080	138	1	呆壳兽	ヤドラン	Slowbro	超级呆壳兽	水	超能力	95	75	180	130	80	30	10	2
80	080	138	2	呆壳兽	ヤドラン	Slowbro	伽勒尔的样子	毒	超能力	95	100	95	100	70	30	9	2
92	092	065	0	鬼斯	ゴース	Gastly		幽灵	毒	30	35	30	100	35	80	11	2
93	093	066	0	鬼斯通	ゴースト	Haunter		幽灵	毒	45	50	45	115	55	95	12	2
94	094	067	0	耿鬼	ゲンガー	Gengar		幽灵	毒	60	65	60	130	75	110	13	2
94	094	067	1	耿鬼	ゲンガー	Gengar	超级耿鬼	幽灵	毒	60	65	80	170	95	130	14	2
95	095	197	0	大岩蛇	イワーク	Onix		岩石	地面	35	45	160	30	45	70	15	2
115	115	223	0	袋兽	ガルーラ	Kangaskhan		一般	一般	105	95	80	40	80	90	16	2
115	115	223	1	袋兽	ガルーラ	Kangaskhan	超级袋兽	一般	一般	105	125	100	60	100	100	17	2
120	120	036	0	海星星	ヒトデマン	Staryu		水	水	30	45	55	70	55	85	18	2
121	121	037	0	宝石海星	スターミー	Starmie		水	超能力	60	75	85	100	85	115	19	2
121	121	037	1	宝石海星	スターミー	Starmie	超级宝石海星	水	超能力	60	140	105	130	105	120	0	3
123	123	176	0	飞天螳螂	ストライク	Scyther		虫	飞行	70	110	80	55	80	105	2	3
127	127	178	0	凯罗斯	カイロス	Pinsir		虫	虫	65	125	100	55	70	85	3	3
127	127	178	1	凯罗斯	カイロス	Pinsir	超级凯罗斯	虫	飞行	65	155	120	65	90	105	4	3
129	129	032	0	鲤鱼王	コイキング	Magikarp		水	水	20	10	55	15	20	80	6	3
130	130	033	0	暴鲤龙	ギャラドス	Gyarados		水	飞行	95	125	79	60	100	81	8	3
130	130	033	1	暴鲤龙	ギャラドス	Gyarados	超级暴鲤龙	水	恶	95	155	109	70	130	81	9	3
133	133	100	0	伊布	イーブイ	Eevee		一般	一般	55	55	50	45	65	55	11	3
134	134	101	0	水伊布	シャワーズ	Vaporeon		水	水	130	65	60	110	95	65	12	3
135	135	102	0	雷伊布	サンダース	Jolteon		电	电	65	65	60	110	95	130	13	3
136	136	103	0	火伊布	ブースター	Flareon		火	火	65	130	60	95	110	65	14	3
142	142	192	0	化石翼龙	プテラ	Aerodactyl		岩石	飞行	80	105	65	60	75	130	15	3
142	142	192	1	化石翼龙	プテラ	Aerodactyl	超级化石翼龙	岩石	飞行	80	135	85	70	95	150	16	3
147	147	145	0	迷你龙	ミニリュウ	Dratini		龙	龙	41	64	45	50	50	50	17	3
148	148	146	0	哈克龙	ハクリュー	Dragonair		龙	龙	61	84	65	70	70	70	18	3
149	149	147	0	快龙	カイリュー	Dragonite		龙	飞行	91	134	95	100	100	80	19	3
149	149	147	1	快龙	カイリュー	Dragonite	超级快龙	龙	飞行	91	124	115	145	125	100	0	4
150	150	232	0	超梦	ミュウツー	Mewtwo		超能力	超能力	106	110	90	154	90	130	1	4
150	150	232	1	超梦	ミュウツー	Mewtwo	超级超梦Ｘ	超能力	格斗	106	190	100	154	100	130	2	4
150	150	232	2	超梦	ミュウツー	Mewtwo	超级超梦Ｙ	超能力	超能力	106	150	70	194	120	140	3	4
152	152	001	0	菊草叶	チコリータ	Chikorita		草	草	45	49	65	49	65	45	4	4
153	153	002	0	月桂叶	ベイリーフ	Bayleef		草	草	60	62	80	63	80	60	5	4
154	154	003	0	大竺葵	メガニウム	Meganium		草	草	80	82	100	83	100	80	7	4
154	154	003	1	大竺葵	メガニウム	Meganium	超级大竺葵	草	妖精	80	92	115	143	115	80	8	4
158	158	007	0	小锯鳄	ワニノコ	Totodile		水	水	50	65	64	44	48	43	9	4
159	159	008	0	蓝鳄	アリゲイツ	Croconaw		水	水	65	80	80	59	63	58	10	4
160	160	009	0	大力鳄	オーダイル	Feraligatr		水	水	85	105	100	79	83	78	11	4
160	160	009	1	大力鳄	オーダイル	Feraligatr	超级大力鳄	水	龙	85	160	125	89	93	78	12	4
167	167	058	0	圆丝蛛	イトマル	Spinarak		虫	毒	40	60	40	40	40	30	13	4
168	168	059	0	阿利多斯	アリアドス	Ariados		虫	毒	70	90	70	60	70	40	14	4
172	172	052	0	皮丘	ピチュー	Pichu		电	电	20	40	15	35	35	60	15	4
173	173	055	0	皮宝宝	ピィ	Cleffa		妖精	妖精	50	25	28	45	55	15	16	4
179	179	024	0	咩利羊	メリープ	Mareep		电	电	55	40	40	65	45	35	17	4
180	180	025	0	茸茸羊	モココ	Flaaffy		电	电	70	55	55	80	60	45	18	4
181	181	026	0	电龙	デンリュウ	Ampharos		电	电	90	75	85	115	90	55	19	4
181	181	026	1	电龙	デンリュウ	Ampharos	超级电龙	电	龙	90	95	105	165	110	45	0	5
196	196	104	0	太阳伊布	エーフィ	Espeon		超能力	超能力	65	65	60	130	95	110	1	5
197	197	105	0	月亮伊布	ブラッキー	Umbreon		恶	恶	95	65	110	60	130	65	2	5
199	199	139	0	呆呆王	ヤドキング	Slowking		水	超能力	95	75	80	100	110	30	3	5
199	199	139	1	呆呆王	ヤドキング	Slowking	伽勒尔的样子	毒	超能力	95	65	80	110	110	30	4	5
208	208	198	0	大钢蛇	ハガネール	Steelix		钢	地面	75	85	200	55	65	30	6	5
208	208	198	1	大钢蛇	ハガネール	Steelix	超级大钢蛇	钢	地面	75	125	230	55	95	30	7	5
212	212	177	0	巨钳螳螂	ハッサム	Scizor		虫	钢	70	130	100	55	80	65	9	5
212	212	177	1	巨钳螳螂	ハッサム	Scizor	超级巨钳螳螂	虫	钢	70	150	140	65	100	75	10	5
214	214	179	0	赫拉克罗斯	ヘラクロス	Heracross		虫	格斗	80	125	75	40	95	85	12	5
214	214	179	1	赫拉克罗斯	ヘラクロス	Heracross	超级赫拉克罗斯	虫	格斗	80	185	115	40	105	75	13	5
225	225	168	0	信使鸟	デリバード	Delibird		冰	飞行	45	55	45	65	45	75	14	5
227	227	216	0	盔甲鸟	エアームド	Skarmory		钢	飞行	65	80	140	40	70	70	15	5
227	227	216	1	盔甲鸟	エアームド	Skarmory	超级盔甲鸟	钢	飞行	65	140	110	40	100	110	16	5
228	228	091	0	戴鲁比	デルビル	Houndour		恶	火	45	60	30	80	50	65	17	5
229	229	092	0	黑鲁加	ヘルガー	Houndoom		恶	火	75	90	50	110	80	95	19	5
229	229	092	1	黑鲁加	ヘルガー	Houndoom	超级黑鲁加	恶	火	75	90	90	140	90	115	0	6
246	246	206	0	幼基拉斯	ヨーギラス	Larvitar		岩石	地面	50	64	50	45	50	41	1	6
247	247	207	0	沙基拉斯	サナギラス	Pupitar		岩石	地面	70	84	70	65	70	51	2	6
248	248	208	0	班基拉斯	バンギラス	Tyranitar		岩石	恶	100	134	110	95	100	61	3	6
248	248	208	1	班基拉斯	バンギラス	Tyranitar	超级班基拉斯	岩石	恶	100	164	150	95	120	71	4	6
280	280	087	0	拉鲁拉丝	ラルトス	Ralts		超能力	妖精	28	25	25	45	35	40	5	6
281	281	088	0	奇鲁莉安	キルリア	Kirlia		超能力	妖精	38	35	35	65	55	50	6	6
282	282	089	0	沙奈朵	サーナイト	Gardevoir		超能力	妖精	68	65	65	125	115	80	7	6
282	282	089	1	沙奈朵	サーナイト	Gardevoir	超级沙奈朵	超能力	妖精	68	85	65	165	135	100	8	6
302	302	132	0	勾魂眼	ヤミラミ	Sableye		恶	幽灵	50	75	75	65	65	50	9	6
302	302	132	1	勾魂眼	ヤミラミ	Sableye	超级勾魂眼	恶	幽灵	50	85	125	85	115	20	10	6
303	303	133	0	大嘴娃	クチート	Mawile		钢	妖精	50	85	85	55	55	50	11	6
303	303	133	1	大嘴娃	クチート	Mawile	超级大嘴娃	钢	妖精	50	147	125	55	95	50	12	6
304	304	199	0	可可多拉	ココドラ	Aron		钢	岩石	50	70	100	40	40	30	13	6
305	305	200	0	可多拉	コドラ	Lairon		钢	岩石	60	90	140	50	50	40	14	6
306	306	201	0	波士可多拉	ボスゴドラ	Aggron		钢	岩石	70	110	180	60	60	50	15	6
306	306	201	1	波士可多拉	ボスゴドラ	Aggron	超级波士可多拉	钢	钢	70	140	230	60	80	50	16	6
307	307	083	0	玛沙那	アサナン	Meditite		格斗	超能力	30	56	55	40	55	60	18	6
308	308	084	0	恰雷姆	チャーレム	Medicham		格斗	超能力	60	84	75	60	75	80	0	7
308	308	084	1	恰雷姆	チャーレム	Medicham	超级恰雷姆	格斗	超能力	60	140	85	80	85	100	1	7
309	309	085	0	落雷兽	ラクライ	Electrike		电	电	40	45	40	65	40	65	2	7
310	310	086	0	雷电兽	ライボルト	Manectric		电	电	70	75	60	105	60	105	3	7
310	310	086	1	雷电兽	ライボルト	Manectric	超级雷电兽	电	电	70	75	80	135	80	135	4	7
315	315	030	0	毒蔷薇	ロゼリア	Roselia		草	毒	50	60	45	100	80	65	6	7
318	318	140	0	利牙鱼	キバニア	Carvanha		水	恶	45	90	20	65	20	65	7	7
319	319	141	0	巨牙鲨	サメハダー	Sharpedo		水	恶	70	120	40	95	40	95	8	7
319	319	141	1	巨牙鲨	サメハダー	Sharpedo	超级巨牙鲨	水	恶	70	140	70	110	65	105	9	7
322	322	116	0	呆火驼	ドンメル	Numel		火	地面	60	60	40	65	45	35	11	7
323	323	117	0	喷火驼	バクーダ	Camerupt		火	地面	70	100	70	105	75	40	13	7
323	323	117	1	喷火驼	バクーダ	Camerupt	超级喷火驼	火	地面	70	120	100	145	105	20	14	7
333	333	093	0	青绵鸟	チルット	Swablu		一般	飞行	45	40	60	40	75	50	15	7
334	334	094	0	七夕青鸟	チルタリス	Altaria		龙	飞行	75	70	90	70	105	80	16	7
334	334	094	1	七夕青鸟	チルタリス	Altaria	超级七夕青鸟	龙	妖精	75	110	110	110	105	80	17	7
353	353	111	0	怨影娃娃	カゲボウズ	Shuppet		幽灵	幽灵	44	75	35	63	33	45	18	7
354	354	112	0	诅咒娃娃	ジュペッタ	Banette		幽灵	幽灵	64	115	65	83	63	65	19	7
354	354	112	1	诅咒娃娃	ジュペッタ	Banette	超级诅咒娃娃	幽灵	幽灵	64	165	75	93	83	75	0	8
359	359	134	0	阿勃梭鲁	アブソル	Absol		恶	恶	65	130	60	75	60	75	1	8
359	359	134	1	阿勃梭鲁	アブソル	Absol	超级阿勃梭鲁	恶	恶	65	150	60	115	60	115	2	8
361	361	169	0	雪童子	ユキワラシ	Snorunt		冰	冰	50	50	50	50	50	50	3	8
362	362	170	0	冰鬼护	オニゴーリ	Glalie		冰	冰	80	80	80	80	80	80	4	8
362	362	170	1	冰鬼护	オニゴーリ	Glalie	超级冰鬼护	冰	冰	80	120	80	120	80	100	5	8
371	371	220	0	宝贝龙	タツベイ	Bagon		龙	龙	45	75	60	40	30	50	6	8
372	372	221	0	甲壳龙	コモルー	Shelgon		龙	龙	65	95	100	60	50	50	7	8
373	373	222	0	暴飞龙	ボーマンダ	Salamence		龙	飞行	95	135	80	110	80	100	8	8
373	373	222	1	暴飞龙	ボーマンダ	Salamence	超级暴飞龙	龙	飞行	95	145	130	120	90	120	9	8
374	374	225	0	铁哑铃	ダンバル	Beldum		钢	超能力	40	55	80	35	60	30	10	8
375	375	226	0	金属怪	メタング	Metang		钢	超能力	60	75	100	55	80	50	11	8
376	376	227	0	巨金怪	メタグロス	Metagross		钢	超能力	80	135	130	95	90	70	12	8
376	376	227	1	巨金怪	メタグロス	Metagross	超级巨金怪	钢	超能力	80	145	150	105	110	110	13	8
406	406	029	0	含羞苞	スボミー	Budew		草	毒	40	30	35	50	70	55	14	8
407	407	031	0	罗丝雷朵	ロズレイド	Roserade		草	毒	60	70	65	125	105	90	16	8
427	427	109	0	卷卷耳	ミミロル	Buneary		一般	一般	55	66	44	44	56	85	17	8
428	428	110	0	长耳兔	ミミロップ	Lopunny		一般	一般	65	76	84	54	96	105	18	8
428	428	110	1	长耳兔	ミミロップ	Lopunny	超级长耳兔	一般	格斗	65	136	94	54	96	135	19	8
443	443	128	0	圆陆鲨	フカマル	Gible		龙	地面	58	70	45	40	45	42	1	9
444	444	129	0	尖牙陆鲨	ガバイト	Gabite		龙	地面	68	90	65	50	55	82	3	9
445	445	130	0	烈咬陆鲨	ガブリアス	Garchomp		龙	地面	108	130	95	80	85	102	5	9
445	445	130	1	烈咬陆鲨	ガブリアス	Garchomp	超级烈咬陆鲨	龙	地面	108	170	115	120	95	92	6	9
447	447	135	0	利欧路	リオル	Riolu		格斗	格斗	40	70	40	35	40	60	7	9
448	448	136	0	路卡利欧	ルカリオ	Lucario		格斗	钢	70	110	70	115	70	90	8	9
448	448	136	1	路卡利欧	ルカリオ	Lucario	超级路卡利欧	格斗	钢	70	145	88	140	70	112	9	9
449	449	118	0	沙河马	ヒポポタス	Hippopotas		地面	地面	68	72	78	38	42	32	11	9
450	450	119	0	河马兽	カバルドン	Hippowdon		地面	地面	108	112	118	68	72	47	13	9
459	459	172	0	雪笠怪	ユキカブリ	Snover		草	冰	60	62	50	62	60	40	15	9
460	460	173	0	暴雪王	ユキノオー	Abomasnow		草	冰	90	92	75	92	85	60	17	9
460	460	173	1	暴雪王	ユキノオー	Abomasnow	超级暴雪王	草	冰	90	132	105	132	105	30	18	9
470	470	106	0	叶伊布	リーフィア	Leafeon		草	草	65	110	130	60	65	95	19	9
471	471	107	0	冰伊布	グレイシア	Glaceon		冰	冰	65	60	110	130	95	65	0	10
475	475	090	0	艾路雷朵	エルレイド	Gallade		超能力	格斗	68	125	65	65	115	80	1	10
475	475	090	1	艾路雷朵	エルレイド	Gallade	超级艾路雷朵	超能力	格斗	68	165	95	65	115	110	2	10
478	478	171	0	雪妖女	ユキメノコ	Froslass		冰	幽灵	70	80	70	80	70	110	3	10
478	478	171	1	雪妖女	ユキメノコ	Froslass	超级雪妖女	冰	幽灵	70	80	70	140	100	120	4	10
498	498	004	0	暖暖猪	ポカブ	Tepig		火	火	65	63	45	45	45	45	5	10
499	499	005	0	炒炒猪	チャオブー	Pignite		火	格斗	90	93	55	70	55	55	6	10
500	500	006	0	炎武王	エンブオー	Emboar		火	格斗	110	123	65	100	65	65	7	10
500	500	006	1	炎武王	エンブオー	Emboar	超级炎武王	火	格斗	110	148	75	110	110	75	8	10
504	504	027	0	探探鼠	ミネズミ	Patrat		一般	一般	45	55	39	35	39	42	9	10
505	505	028	0	步哨鼠	ミルホッグ	Watchog		一般	一般	60	85	69	60	69	77	10	10
511	511	077	0	花椰猴	ヤナップ	Pansage		草	草	50	53	48	53	48	64	11	10
512	512	078	0	花椰猿	ヤナッキー	Simisage		草	草	75	98	63	98	63	101	12	10
513	513	079	0	爆香猴	バオップ	Pansear		火	火	50	53	48	53	48	64	13	10
514	514	080	0	爆香猿	バオッキー	Simisear		火	火	75	98	63	98	63	101	14	10
515	515	081	0	冷水猴	ヒヤップ	Panpour		水	水	50	53	48	53	48	64	15	10
516	516	082	0	冷水猿	ヒヤッキー	Simipour		水	水	75	98	63	98	63	101	16	10
529	529	120	0	螺钉地鼠	モグリュー	Drilbur		地面	地面	60	85	40	30	45	68	17	10
530	530	121	0	龙头地鼠	ドリュウズ	Excadrill		地面	钢	110	135	60	50	65	88	18	10
530	530	121	1	龙头地鼠	ドリュウズ	Excadrill	超级龙头地鼠	地面	钢	110	165	100	65	65	103	19	10
531	531	095	0	差不多娃娃	タブンネ	Audino		一般	一般	103	60	86	60	86	50	0	11
531	531	095	1	差不多娃娃	タブンネ	Audino	超级差不多娃娃	一般	妖精	103	60	126	80	126	50	1	11
543	543	068	0	百足蜈蚣	フシデ	Venipede		虫	毒	30	45	59	30	39	57	2	11
544	544	069	0	车轮球	ホイーガ	Whirlipede		虫	毒	40	55	99	40	79	47	3	11
545	545	070	0	蜈蚣王	ペンドラー	Scolipede		虫	毒	60	100	89	55	69	112	4	11
545	545	070	1	蜈蚣王	ペンドラー	Scolipede	超级蜈蚣王	虫	毒	60	140	149	75	99	62	5	11
551	551	122	0	黑眼鳄	メグロコ	Sandile		地面	恶	50	72	35	35	35	65	6	11
552	552	123	0	混混鳄	ワルビル	Krokorok		地面	恶	60	82	45	45	45	74	7	11
553	553	124	0	流氓鳄	ワルビアル	Krookodile		地面	恶	95	117	80	65	70	92	8	11
559	559	184	0	滑滑小子	ズルッグ	Scraggy		恶	格斗	50	75	70	35	70	48	9	11
560	560	185	0	头巾混混	ズルズキン	Scrafty		恶	格斗	65	90	115	45	115	58	10	11
560	560	185	1	头巾混混	ズルズキン	Scrafty	超级头巾混混	恶	格斗	65	130	135	55	135	68	11	11
568	568	049	0	破破袋	ヤブクロン	Trubbish		毒	毒	50	50	62	40	62	65	12	11
569	569	050	0	灰尘山	ダストダス	Garbodor		毒	毒	80	95	82	60	82	75	13	11
582	582	113	0	迷你冰	バニプッチ	Vanillite		冰	冰	36	50	50	65	60	44	14	11
583	583	114	0	多多冰	バニリッチ	Vanillish		冰	冰	51	65	65	80	75	59	15	11
584	584	115	0	双倍多多冰	バイバニラ	Vanilluxe		冰	冰	71	95	85	110	95	79	16	11
587	587	180	0	电飞鼠	エモンガ	Emolga		电	飞行	55	75	60	75	60	103	17	11
602	602	142	0	麻麻小鱼	シビシラス	Tynamo		电	电	35	55	40	45	40	60	18	11
603	603	143	0	麻麻鳗	シビビール	Eelektrik		电	电	65	85	70	75	70	40	19	11
604	604	144	0	麻麻鳗鱼王	シビルドン	Eelektross		电	电	85	115	80	105	80	50	0	12
604	604	144	1	麻麻鳗鱼王	シビルドン	Eelektross	超级麻麻鳗鱼王	电	电	85	145	80	135	90	80	1	12
607	607	189	0	烛光灵	ヒトモシ	Litwick		幽灵	火	50	30	55	65	55	20	2	12
608	608	190	0	灯火幽灵	ランプラー	Lampent		幽灵	火	60	40	60	95	60	55	3	12
609	609	191	0	水晶灯火灵	シャンデラ	Chandelure		幽灵	火	60	55	90	145	90	80	4	12
609	609	191	1	水晶灯火灵	シャンデラ	Chandelure	超级水晶灯火灵	幽灵	火	60	75	110	175	110	90	5	12
618	618	157	0	泥巴鱼	マッギョ	Stunfisk		地面	电	109	66	84	81	99	32	7	12
618	618	157	1	泥巴鱼	マッギョ	Stunfisk	伽勒尔的样子	地面	钢	109	81	99	66	84	32	7	12
650	650	213	0	哈力栗	ハリマロン	Chespin		草	草	56	61	65	48	45	38	8	12
651	651	214	0	胖胖哈力	ハリボーグ	Quilladin		草	草	61	78	95	56	58	57	9	12
652	652	215	0	布里卡隆	ブリガロン	Chesnaught		草	格斗	88	107	122	74	75	64	10	12
652	652	215	1	布里卡隆	ブリガロン	Chesnaught	超级布里卡隆	草	格斗	88	137	172	74	115	44	11	12
653	653	217	0	火狐狸	フォッコ	Fennekin		火	火	40	45	40	62	60	60	12	12
654	654	218	0	长尾火狐	テールナー	Braixen		火	火	59	59	58	90	70	73	13	12
655	655	219	0	妖火红狐	マフォクシー	Delphox		火	超能力	75	69	72	114	100	104	14	12
655	655	219	1	妖火红狐	マフォクシー	Delphox	超级妖火红狐	火	超能力	75	69	72	159	125	134	15	12
656	656	209	0	呱呱泡蛙	ケロマツ	Froakie		水	水	41	56	40	62	44	71	16	12
657	657	210	0	呱头蛙	ゲコガシラ	Frogadier		水	水	54	63	52	83	56	97	17	12
658	658	211	0	甲贺忍蛙	ゲッコウガ	Greninja		水	恶	72	95	67	103	71	122	18	12
658	658	211	1	甲贺忍蛙	ゲッコウガ	Greninja		水	恶	72	95	67	103	71	122	18	12
658	658	211	3	甲贺忍蛙	ゲッコウガ	Greninja	超级甲贺忍蛙	水	恶	72	125	77	133	81	142	19	12
659	659	013	0	掘掘兔	ホルビー	Bunnelby		一般	一般	38	36	38	32	36	57	0	13
660	660	014	0	掘地兔	ホルード	Diggersby		一般	地面	85	56	77	50	77	78	1	13
661	661	010	0	小箭雀	ヤヤコマ	Fletchling		一般	飞行	45	50	43	40	38	62	2	13
662	662	011	0	火箭雀	ヒノヤコマ	Fletchinder		火	飞行	62	73	55	56	52	84	3	13
663	663	012	0	烈箭鹰	ファイアロー	Talonflame		火	飞行	78	81	71	74	69	126	4	13
664	664	015	0	粉蝶虫	コフキムシ	Scatterbug		虫	虫	38	35	40	27	25	35	5	13
664	664	015	1	粉蝶虫	コフキムシ	Scatterbug		虫	虫	38	35	40	27	25	35	5	13
664	664	015	2	粉蝶虫	コフキムシ	Scatterbug		虫	虫	38	35	40	27	25	35	5	13
664	664	015	3	粉蝶虫	コフキムシ	Scatterbug		虫	虫	38	35	40	27	25	35	5	13
664	664	015	4	粉蝶虫	コフキムシ	Scatterbug		虫	虫	38	35	40	27	25	35	5	13
664	664	015	5	粉蝶虫	コフキムシ	Scatterbug		虫	虫	38	35	40	27	25	35	5	13
664	664	015	6	粉蝶虫	コフキムシ	Scatterbug		虫	虫	38	35	40	27	25	35	5	13
664	664	015	7	粉蝶虫	コフキムシ	Scatterbug		虫	虫	38	35	40	27	25	35	5	13
664	664	015	8	粉蝶虫	コフキムシ	Scatterbug		虫	虫	38	35	40	27	25	35	5	13
664	664	015	9	粉蝶虫	コフキムシ	Scatterbug		虫	虫	38	35	40	27	25	35	5	13
664	664	015	10	粉蝶虫	コフキムシ	Scatterbug		虫	虫	38	35	40	27	25	35	5	13
664	664	015	11	粉蝶虫	コフキムシ	Scatterbug		虫	虫	38	35	40	27	25	35	5	13
664	664	015	12	粉蝶虫	コフキムシ	Scatterbug		虫	虫	38	35	40	27	25	35	5	13
664	664	015	13	粉蝶虫	コフキムシ	Scatterbug		虫	虫	38	35	40	27	25	35	5	13
664	664	015	14	粉蝶虫	コフキムシ	Scatterbug		虫	虫	38	35	40	27	25	35	5	13
664	664	015	15	粉蝶虫	コフキムシ	Scatterbug		虫	虫	38	35	40	27	25	35	5	13
664	664	015	16	粉蝶虫	コフキムシ	Scatterbug		虫	虫	38	35	40	27	25	35	5	13
664	664	015	17	粉蝶虫	コフキムシ	Scatterbug		虫	虫	38	35	40	27	25	35	5	13
664	664	015	18	粉蝶虫	コフキムシ	Scatterbug		虫	虫	38	35	40	27	25	35	5	13
664	664	015	19	粉蝶虫	コフキムシ	Scatterbug		虫	虫	38	35	40	27	25	35	5	13
665	665	016	0	粉蝶蛹	コフーライ	Spewpa		虫	虫	45	22	60	27	30	29	6	13
665	665	016	1	粉蝶蛹	コフーライ	Spewpa		虫	虫	45	22	60	27	30	29	6	13
665	665	016	2	粉蝶蛹	コフーライ	Spewpa		虫	虫	45	22	60	27	30	29	6	13
665	665	016	3	粉蝶蛹	コフーライ	Spewpa		虫	虫	45	22	60	27	30	29	6	13
665	665	016	4	粉蝶蛹	コフーライ	Spewpa		虫	虫	45	22	60	27	30	29	6	13
665	665	016	5	粉蝶蛹	コフーライ	Spewpa		虫	虫	45	22	60	27	30	29	6	13
665	665	016	6	粉蝶蛹	コフーライ	Spewpa		虫	虫	45	22	60	27	30	29	6	13
665	665	016	7	粉蝶蛹	コフーライ	Spewpa		虫	虫	45	22	60	27	30	29	6	13
665	665	016	8	粉蝶蛹	コフーライ	Spewpa		虫	虫	45	22	60	27	30	29	6	13
665	665	016	9	粉蝶蛹	コフーライ	Spewpa		虫	虫	45	22	60	27	30	29	6	13
665	665	016	10	粉蝶蛹	コフーライ	Spewpa		虫	虫	45	22	60	27	30	29	6	13
665	665	016	11	粉蝶蛹	コフーライ	Spewpa		虫	虫	45	22	60	27	30	29	6	13
665	665	016	12	粉蝶蛹	コフーライ	Spewpa		虫	虫	45	22	60	27	30	29	6	13
665	665	016	13	粉蝶蛹	コフーライ	Spewpa		虫	虫	45	22	60	27	30	29	6	13
665	665	016	14	粉蝶蛹	コフーライ	Spewpa		虫	虫	45	22	60	27	30	29	6	13
665	665	016	15	粉蝶蛹	コフーライ	Spewpa		虫	虫	45	22	60	27	30	29	6	13
665	665	016	16	粉蝶蛹	コフーライ	Spewpa		虫	虫	45	22	60	27	30	29	6	13
665	665	016	17	粉蝶蛹	コフーライ	Spewpa		虫	虫	45	22	60	27	30	29	6	13
665	665	016	18	粉蝶蛹	コフーライ	Spewpa		虫	虫	45	22	60	27	30	29	6	13
665	665	016	19	粉蝶蛹	コフーライ	Spewpa		虫	虫	45	22	60	27	30	29	6	13
666	666	017	0	彩粉蝶	ビビヨン	Vivillon	冰雪花纹	虫	飞行	80	52	50	90	50	89	7	13
666	666	017	1	彩粉蝶	ビビヨン	Vivillon	雪国花纹	虫	飞行	80	52	50	90	50	89	8	13
666	666	017	2	彩粉蝶	ビビヨン	Vivillon	雪原花纹	虫	飞行	80	52	50	90	50	89	9	13
666	666	017	3	彩粉蝶	ビビヨン	Vivillon	大陆花纹	虫	飞行	80	52	50	90	50	89	10	13
666	666	017	4	彩粉蝶	ビビヨン	Vivillon	庭园花纹	虫	飞行	80	52	50	90	50	89	11	13
666	666	017	5	彩粉蝶	ビビヨン	Vivillon	高雅花纹	虫	飞行	80	52	50	90	50	89	12	13
666	666	017	6	彩粉蝶	ビビヨン	Vivillon	花园花纹	虫	飞行	80	52	50	90	50	89	13	13
666	666	017	7	彩粉蝶	ビビヨン	Vivillon	摩登花纹	虫	飞行	80	52	50	90	50	89	14	13
666	666	017	8	彩粉蝶	ビビヨン	Vivillon	大海花纹	虫	飞行	80	52	50	90	50	89	15	13
666	666	017	9	彩粉蝶	ビビヨン	Vivillon	群岛花纹	虫	飞行	80	52	50	90	50	89	16	13
666	666	017	10	彩粉蝶	ビビヨン	Vivillon	荒野花纹	虫	飞行	80	52	50	90	50	89	17	13
666	666	017	11	彩粉蝶	ビビヨン	Vivillon	沙尘花纹	虫	飞行	80	52	50	90	50	89	18	13
666	666	017	12	彩粉蝶	ビビヨン	Vivillon	大河花纹	虫	飞行	80	52	50	90	50	89	19	13
666	666	017	13	彩粉蝶	ビビヨン	Vivillon	骤雨花纹	虫	飞行	80	52	50	90	50	89	0	14
666	666	017	14	彩粉蝶	ビビヨン	Vivillon	热带草原花纹	虫	飞行	80	52	50	90	50	89	1	14
666	666	017	15	彩粉蝶	ビビヨン	Vivillon	太阳花纹	虫	飞行	80	52	50	90	50	89	2	14
666	666	017	16	彩粉蝶	ビビヨン	Vivillon	大洋花纹	虫	飞行	80	52	50	90	50	89	3	14
666	666	017	17	彩粉蝶	ビビヨン	Vivillon	热带雨林花纹	虫	飞行	80	52	50	90	50	89	4	14
666	666	017	18	彩粉蝶	ビビヨン	Vivillon	幻彩花纹	虫	飞行	80	52	50	90	50	89	5	14
666	666	017	19	彩粉蝶	ビビヨン	Vivillon	球球花纹	虫	飞行	80	52	50	90	50	89	6	14
667	667	045	0	小狮狮	シシコ	Litleo		火	一般	62	50	58	73	54	72	7	14
668	668	046	0	火炎狮	カエンジシ	Pyroar		火	一般	86	68	72	109	66	106	9	14
668	668	046	1	火炎狮	カエンジシ	Pyroar	超级火炎狮	火	一般	86	88	92	129	86	126	10	14
669	669	038	0	花蓓蓓	フラベベ	Flabébé	红花	妖精	妖精	44	38	39	61	79	42	11	14
669	669	038	1	花蓓蓓	フラベベ	Flabébé	黄花	妖精	妖精	44	38	39	61	79	42	12	14
669	669	038	2	花蓓蓓	フラベベ	Flabébé	橙花	妖精	妖精	44	38	39	61	79	42	13	14
669	669	038	3	花蓓蓓	フラベベ	Flabébé	蓝花	妖精	妖精	44	38	39	61	79	42	14	14
669	669	038	4	花蓓蓓	フラベベ	Flabébé	白花	妖精	妖精	44	38	39	61	79	42	15	14
670	670	039	0	花叶蒂	フラエッテ	Floette	红花	妖精	妖精	54	45	47	75	98	52	16	14
670	670	039	1	花叶蒂	フラエッテ	Floette	黄花	妖精	妖精	54	45	47	75	98	52	17	14
670	670	039	2	花叶蒂	フラエッテ	Floette	橙花	妖精	妖精	54	45	47	75	98	52	18	14
670	670	039	3	花叶蒂	フラエッテ	Floette	蓝花	妖精	妖精	54	45	47	75	98	52	19	14
670	670	039	4	花叶蒂	フラエッテ	Floette	白花	妖精	妖精	54	45	47	75	98	52	0	15
670	670	039	5	花叶蒂	フラエッテ	Floette	永恒之花	妖精	妖精	74	65	67	125	128	92	1	15
670	670	039	6	花叶蒂	フラエッテ	Floette	超级花叶蒂	妖精	妖精	74	85	87	155	148	102	2	15
671	671	040	0	花洁夫人	フラージェス	Florges	红花	妖精	妖精	78	65	68	112	154	75	3	15
671	671	040	1	花洁夫人	フラージェス	Florges	黄花	妖精	妖精	78	65	68	112	154	75	4	15
671	671	040	2	花洁夫人	フラージェス	Florges	橙花	妖精	妖精	78	65	68	112	154	75	5	15
671	671	040	3	花洁夫人	フラージェス	Florges	蓝花	妖精	妖精	78	65	68	112	154	75	6	15
671	671	040	4	花洁夫人	フラージェス	Florges	白花	妖精	妖精	78	65	68	112	154	75	7	15
672	672	041	0	坐骑小羊	メェークル	Skiddo		草	草	66	65	48	62	57	52	8	15
673	673	042	0	坐骑山羊	ゴーゴート	Gogoat		草	草	123	100	62	97	81	68	9	15
674	674	047	0	顽皮熊猫	ヤンチャム	Pancham		格斗	格斗	67	82	62	46	48	43	10	15
675	675	048	0	霸道熊猫	ゴロンダ	Pangoro		格斗	恶	95	124	78	69	71	58	11	15
676	676	158	0	多丽米亚	トリミアン	Furfrou	野生的样子	一般	一般	75	80	60	65	90	102	12	15
676	676	158	1	多丽米亚	トリミアン	Furfrou	心形造型	一般	一般	75	80	60	65	90	102	13	15
676	676	158	2	多丽米亚	トリミアン	Furfrou	星形造型	一般	一般	75	80	60	65	90	102	14	15
676	676	158	3	多丽米亚	トリミアン	Furfrou	菱形造型	一般	一般	75	80	60	65	90	102	15	15
676	676	158	4	多丽米亚	トリミアン	Furfrou	淑女造型	一般	一般	75	80	60	65	90	102	16	15
676	676	158	5	多丽米亚	トリミアン	Furfrou	贵妇造型	一般	一般	75	80	60	65	90	102	17	15
676	676	158	6	多丽米亚	トリミアン	Furfrou	绅士造型	一般	一般	75	80	60	65	90	102	18	15
676	676	158	7	多丽米亚	トリミアン	Furfrou	女王造型	一般	一般	75	80	60	65	90	102	19	15
676	676	158	8	多丽米亚	トリミアン	Furfrou	歌舞伎造型	一般	一般	75	80	60	65	90	102	0	16
676	676	158	9	多丽米亚	トリミアン	Furfrou	国王造型	一般	一般	75	80	60	65	90	102	1	16
677	677	043	0	妙喵	ニャスパー	Espurr		超能力	超能力	62	48	54	63	60	68	2	16
678	678	044	0	超能妙喵	ニャオニクス	Meowstic	雄性的样子	超能力	超能力	74	48	76	83	81	104	3	16
678	678	044	1	超能妙喵	ニャオニクス	Meowstic	雌性的样子	超能力	超能力	74	48	76	83	81	104	4	16
679	679	071	0	独剑鞘	ヒトツキ	Honedge		钢	幽灵	45	80	100	35	37	28	5	16
680	680	072	0	双剑鞘	ニダンギル	Doublade		钢	幽灵	59	110	150	45	49	35	6	16
681	681	073	0	坚盾剑怪	ギルガルド	Aegislash	盾牌形态	钢	幽灵	60	50	140	50	140	60	7	16
681	681	073	1	坚盾剑怪	ギルガルド	Aegislash	刀剑形态	钢	幽灵	60	140	50	140	50	60	8	16
682	682	096	0	粉香香	シュシュプ	Spritzee		妖精	妖精	78	52	60	63	65	23	9	16
683	683	097	0	芳香精	フレフワン	Aromatisse		妖精	妖精	101	72	72	99	89	29	10	16
684	684	098	0	绵绵泡芙	ペロッパフ	Swirlix		妖精	妖精	62	48	66	59	57	49	11	16
685	685	099	0	胖甜妮	ペロリーム	Slurpuff		妖精	妖精	82	80	86	85	75	72	12	16
686	686	159	0	好啦鱿	マーイーカ	Inkay		恶	超能力	53	54	53	37	46	45	13	16
687	687	160	0	乌贼王	カラマネロ	Malamar		恶	超能力	86	92	88	68	75	73	14	16
687	687	160	1	乌贼王	カラマネロ	Malamar	超级乌贼王	恶	超能力	86	102	88	98	120	88	15	16
688	688	034	0	龟脚脚	カメテテ	Binacle		岩石	水	42	52	67	39	56	50	16	16
689	689	035	0	龟足巨铠	ガメノデス	Barbaracle		岩石	水	72	105	115	54	86	68	17	16
689	689	035	1	龟足巨铠	ガメノデス	Barbaracle	超级龟足巨铠	岩石	格斗	72	140	130	64	106	88	18	16
690	690	161	0	垃垃藻	クズモー	Skrelp		毒	水	50	60	60	60	60	30	19	16
691	691	162	0	毒藻龙	ドラミドロ	Dragalge		毒	龙	65	75	90	97	123	44	0	17
691	691	162	1	毒藻龙	ドラミドロ	Dragalge	超级毒藻龙	毒	龙	65	85	105	132	163	44	1	17
692	692	163	0	铁臂枪虾	ウデッポウ	Clauncher		水	水	50	53	62	58	63	44	2	17
693	693	164	0	钢炮臂虾	ブロスター	Clawitzer		水	水	71	73	88	120	89	59	3	17
694	694	202	0	伞电蜥	エリキテル	Helioptile		电	一般	44	38	33	61	43	70	4	17
695	695	203	0	光电伞蜥	エレザード	Heliolisk		电	一般	62	55	52	109	94	109	5	17
696	696	193	0	宝宝暴龙	チゴラス	Tyrunt		岩石	龙	58	89	77	45	45	48	6	17
697	697	194	0	怪颚龙	ガチゴラス	Tyrantrum		岩石	龙	82	121	119	69	59	71	7	17
698	698	195	0	冰雪龙	アマルス	Amaura		岩石	冰	77	59	50	67	63	46	8	17
699	699	196	0	冰雪巨龙	アマルルガ	Aurorus		岩石	冰	123	77	72	99	92	58	9	17
700	700	108	0	仙子伊布	ニンフィア	Sylveon		妖精	妖精	95	65	65	110	130	60	10	17
701	701	181	0	摔角鹰人	ルチャブル	Hawlucha		格斗	飞行	78	92	75	74	63	118	11	17
701	701	181	1	摔角鹰人	ルチャブル	Hawlucha	超级摔角鹰人	格斗	飞行	78	137	100	74	93	118	12	17
702	702	051	0	咚咚鼠	デデンネ	Dedenne		电	妖精	67	58	57	81	67	101	13	17
703	703	131	0	小碎钻	メレシー	Carbink		岩石	妖精	50	50	150	50	150	50	14	17
704	704	165	0	黏黏宝	ヌメラ	Goomy		龙	龙	45	50	35	55	75	40	15	17
705	705	166	0	黏美儿	ヌメイル	Sliggoo		龙	龙	68	75	53	83	113	60	16	17
705	705	166	1	黏美儿	ヌメイル	Sliggoo	洗翠的样子	钢	龙	58	75	83	83	113	40	17	17
706	706	167	0	黏美龙	ヌメルゴン	Goodra		龙	龙	90	100	70	110	150	80	18	17
706	706	167	1	黏美龙	ヌメルゴン	Goodra	洗翠的样子	钢	龙	80	100	100	110	150	60	19	17
707	707	188	0	钥圈儿	クレッフィ	Klefki		钢	妖精	57	80	91	80	87	75	0	18
708	708	182	0	小木灵	ボクレー	Phantump		幽灵	草	43	70	48	50	60	38	1	18
709	709	183	0	朽木妖	オーロット	Trevenant		幽灵	草	85	110	76	65	82	56	2	18
710	710	204	0	南瓜精	バケッチャ	Pumpkaboo	中颗种	幽灵	草	49	66	70	44	55	51	3	18
710	710	204	1	南瓜精	バケッチャ	Pumpkaboo	小颗种	幽灵	草	44	66	70	44	55	56	3	18
710	710	204	2	南瓜精	バケッチャ	Pumpkaboo	大颗种	幽灵	草	54	66	70	44	55	46	3	18
710	710	204	3	南瓜精	バケッチャ	Pumpkaboo	巨颗种	幽灵	草	59	66	70	44	55	41	3	18
711	711	205	0	南瓜怪人	パンプジン	Gourgeist	中颗种	幽灵	草	65	90	122	58	75	84	4	18
711	711	205	1	南瓜怪人	パンプジン	Gourgeist	小颗种	幽灵	草	55	85	122	58	75	99	4	18
711	711	205	2	南瓜怪人	パンプジン	Gourgeist	大颗种	幽灵	草	75	95	122	58	75	69	4	18
711	711	205	3	南瓜怪人	パンプジン	Gourgeist	巨颗种	幽灵	草	85	100	122	58	75	54	4	18
712	712	174	0	冰宝	カチコール	Bergmite		冰	冰	55	69	85	32	35	28	5	18
713	713	175	0	冰岩怪	クレベース	Avalugg		冰	冰	95	117	184	44	46	28	6	18
713	713	175	1	冰岩怪	クレベース	Avalugg	洗翠的样子	冰	岩石	95	127	184	34	36	38	7	18
714	714	186	0	嗡蝠	オンバット	Noibat		飞行	龙	40	30	35	45	40	55	8	18
715	715	187	0	音波龙	オンバーン	Noivern		飞行	龙	85	70	80	97	80	123	9	18
716	716	228	0	哲尔尼亚斯	ゼルネアス	Xerneas		妖精	妖精	126	131	95	131	98	99	10	18
717	717	229	0	伊裴尔塔尔	イベルタル	Yveltal		恶	飞行	126	131	95	131	98	99	11	18
718	718	230	0	基格尔德	ジガルデ	Zygarde	５０％形态	龙	地面	108	100	121	81	95	95	12	18
718	718	230	1	基格尔德	ジガルデ	Zygarde	１０％形态	龙	地面	54	100	71	61	85	115	13	18
718	718	230	2	基格尔德	ジガルデ	Zygarde	１０％形态	龙	地面	54	100	71	61	85	115	14	18
718	718	230	3	基格尔德	ジガルデ	Zygarde	５０％形态	龙	地面	108	100	121	81	95	95	15	18
718	718	230	4	基格尔德	ジガルデ	Zygarde	完全体形态	龙	地面	216	100	121	91	95	85	16	18
718	718	230	5	基格尔德	ジガルデ	Zygarde	超级基格尔德	龙	地面	216	70	91	216	85	100	17	18
719	719	231	0	蒂安希	ディアンシー	Diancie		岩石	妖精	50	100	150	100	150	50	18	18
719	719	231	1	蒂安希	ディアンシー	Diancie	超级蒂安希	岩石	妖精	50	160	110	160	110	110	19	18
720	720	000	0	胡帕	フーパ	Hoopa	惩戒胡帕	超能力	幽灵	80	110	60	150	130	70	0	19
720	720	000	1	胡帕	フーパ	Hoopa	解放胡帕	超能力	恶	80	160	60	170	130	80	1	19
721	721	000	0	波尔凯尼恩	ボルケニオン	Volcanion		火	水	80	110	120	130	90	70	2	19
780	780	224	0	老翁龙	ジジーロン	Drampa		一般	龙	78	60	85	135	91	36	3	19
780	780	224	1	老翁龙	ジジーロン	Drampa	超级老翁龙	一般	龙	78	85	110	160	116	36	4	19
870	870	212	0	列阵兵	タイレーツ	Falinks		格斗	格斗	65	100	100	70	60	75	5	19
870	870	212	1	列阵兵	タイレーツ	Falinks	超级列阵兵	格斗	格斗	65	135	135	70	65	100	6	19
`
  .trim()
  .split("\n");

const header = tsv[0].split("\t");

export const PokemonData = tsv
  .slice(1)
  .map((line) => {
    const parts = line.split("\t");
    const dict = Object.fromEntries(parts.map((part, i) => [header[i], part]));
    const item: Pokemon = {
      id: parseInt(dict["编号"], 10),
      national: parseInt(dict["全国图鉴编号"], 10),
      dex: parseInt(dict["图鉴编号"], 10),
      form: parseInt(dict["形态编号"], 10),
      name: dict["中文名"],
      japanese: dict["日文名"],
      english: dict["英文名"],
      formName: dict["形态名"],
      types: [dict["属性1"] as PokemonType, dict["属性2"] as PokemonType],
      base: ["HP", "攻击", "防御", "特攻", "特防", "速度"].map((stat) => parseInt(dict[stat], 10)),
      x: parseInt(dict["X"], 10),
      y: parseInt(dict["Y"], 10),
    };
    return item;
  })
  .filter((pokemon) => !HiddenPokemonForm.includes(getPokemonFullId(pokemon)));
export const PokemonDataByName: Record<string, Pokemon> = Object.fromEntries(
  PokemonData.map((pokemon) => [getPokemonFullName(pokemon), pokemon]),
);
export const PokemonDataById: Record<PokemonForm, Pokemon> = Object.fromEntries(
  PokemonData.map((pokemon) => [getPokemonFullId(pokemon), pokemon]),
);
